examples/Riemann2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

cellNo  128;
xyMax   1.0;
zMax    #eval{ $xyMax/$cellNo };

vertices
(
    ( -$xyMax    -$xyMax    -$zMax )
    (  $xyMax    -$xyMax    -$zMax )
    (  $xyMax     $xyMax    -$zMax )
    ( -$xyMax     $xyMax    -$zMax )
    ( -$xyMax    -$xyMax     $zMax )
    (  $xyMax    -$xyMax     $zMax )
    (  $xyMax     $xyMax     $zMax )
    ( -$xyMax     $xyMax     $zMax )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($cellNo $cellNo 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    sides
    {
        type            patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (0 4 7 3)
            (2 6 5 1)
        );
    }

    frontAndBack
    {
        type            empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
