examples/Riemann2D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme          Kurganov;  // Tadmor Kurganov

advanceScheme       ForwardEuler;  // ForwardEuler TVDRungeKutta3

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
}

laplacianSchemes
{
    default         none;
}

interpolationSchemes
{
    default         none;

    scheme          UWENO5 grad(U);
    schemeV         UWENO5 grad(U);

    reconstruct(rho) $scheme;
    reconstruct(U)  $schemeV;
    reconstruct(T)  $scheme;
}

snGradSchemes
{
    default         none;
}


// ************************************************************************* //
